Rhino.NamespaceDoc
The Rhino namespace contains fundamental types that
define commonly-used value types and classes used in Rhino.
Examples are the Rhino document class,
math class and
application class.