Rhino.Geometry.Quaternion.op_Division(Rhino.Geometry.Quaternion,System.Int32)
Divides all quaternion coefficients by a factor and returns a new quaternion with the result.
q: A quaternion.
y: A number.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.op_Division(Rhino.Geometry.Quaternion,System.Single)
Divides all quaternion coefficients by a factor and returns a new quaternion with the result.
q: A quaternion.
y: A number.
Returns: A new quaternion.