Rhino.FileIO.File3dm.ObjectTable
Do not use. Use Objects instead.

Rhino.FileIO.File3dm.Layers
Gets access to the Rhino.FileIO.File3dmLayerTable class associated with this file,
which contains all layers.