Rhino.Geometry.Light.CreateSunLight(System.Double,System.Double,System.Double)
Constructs a light that represents the Sun.
northAngleDegrees: The angle of North in degrees. North is the angle between positive World Y axis and model North, as measured on World XY plane.
azimuthDegrees: The Azimut angle value in degrees. Azimuth is the compass angle from North.
altitudeDegrees: The Altitude angle in degrees. Altitude is the angle above the ground plane.
Returns: A new sun light.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.

Rhino.Geometry.Light.CreateSunLight(System.Double,System.DateTime,System.DateTimeKind,System.Double,System.Double)
This method is deprecated. Do not use it.
northAngleDegrees: This argument is specified in a deprecated method. Do not use it.
when: This argument is specified in a deprecated method. Do not use it.
whenKind: This argument is specified in a deprecated method. Do not use it.
latitudeDegrees: This argument is specified in a deprecated method. Do not use it.
longitudeDegrees: This argument is specified in a deprecated method. Do not use it.
Returns: This return value is specified by a deprecated method. Do not use it.