Rhino.Display.DisplayPipeline.DrawForeground
Called after all non-highlighted objects have been drawn and PostDrawObjects has been called.
Depth writing and testing are turned OFF. If you want to draw with depth writing/testing,
see PostDrawObjects.