Rhino.Render.RenderPipeline.#ctor(Rhino.RhinoDoc,Rhino.Commands.RunMode,Rhino.PlugIns.PlugIn,System.Drawing.Size,System.String,Rhino.Render.RenderWindow.StandardChannels,System.Boolean,System.Boolean)
Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation.
doc: A Rhino document.
mode: A command running mode, such as scripted or interactive.
plugin: A plug-in.
sizeRendering: The width and height of the rendering.
caption: The caption to display in the frame window.
channels: The color channel or channels.
reuseRenderWindow: true if the rendering window should be reused; otherwise, a new one will be instanciated.
clearLastRendering: true if the last rendering should be removed.

Rhino.Render.RenderPipeline.RenderSize
Gets the render size as specified in the ON_3dmRenderSettings. Will automatically return the correct size based on the ActiveView or custom settings.
Returns: The render size.

Rhino.Render.RenderPipeline.OnRenderBegin
Called by the framework when it is time to start rendering, the render window will be created at this point and it is safe to start
Returns:

Rhino.Render.RenderPipeline.ConfirmationSeconds
Sets the number of seconds that need to elapse during rendering before the user is asked if the rendered image should be saved.