Rhino.Display.RhinoViewport.SetScreenSize(System.Int32,System.Int32)
Do not use. Sets the size of the RhinoViewport.
width: The width in pixels.
height: The height in pixels.

Rhino.Display.RhinoViewport.ClientToScreenPort(System.Drawing.Point@)
Convert a point in parent RhinoView client window coordinates to the Viewport screen port
client coordinates. The screen port of a RhinoViewport may not match the client area of
the parent RhinoView. This occurs in cases when the RhinoViewport is a nested child viewport.
point:
point in client coordinates of parent RhinoView window as input. This is
converted to the screen port client coordinates of the viewport as output.
Returns:
true if the point is inside of the RhinoViewport's screen port rectangle.