Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a point object to the document.
point: location of point.
attributes: attributes to apply to point.
Returns: A unique identifier for the object.