Rhino.Geometry.Vector3d.Reverse
Reverses (inverts) this vector in place.
If this vector contains RhinoMath.UnsetValue, the
reverse will also be invalid and false will be returned.
Returns: true on success or false if the vector is invalid.