Rhino.Geometry.Brep.CreatePatch(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Surface,System.Double)
Constructs a brep patch.
This is the simple version of fit that uses a specified starting surface.
geometry:
Combination of Curves, BrepTrims, Points, PointClouds or Meshes.
Curves and trims are sampled to get points. Trims are sampled for
points and normals.
startingSurface: A starting surface.
tolerance:
Tolerance used by input analysis functions for loop finding, trimming, etc.
Returns:
Brep fit through input on success, or null on error.

Rhino.Geometry.Brep.CreateBooleanIntersection(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Compute the Solid Intersection of two sets of Breps.
firstSet: First set of Breps.
secondSet: Second set of Breps.
tolerance: Tolerance to use for intersection operation.
Returns: An array of Brep results or null on failure.

Rhino.Geometry.Brep.CreateBooleanIntersection(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double)
Compute the Solid Intersection of two Breps.
firstBrep: First Brep for boolean intersection.
secondBrep: Second Brep for boolean intersection.
tolerance: Tolerance to use for intersection operation.
Returns: An array of Brep results or null on failure.

Rhino.Geometry.Brep.CreateBooleanDifference(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Compute the Solid Difference of two sets of Breps.
firstSet: First set of Breps (the set to subtract from).
secondSet: Second set of Breps (the set to subtract).
tolerance: Tolerance to use for difference operation.
Returns: An array of Brep results or null on failure.

Rhino.Geometry.Brep.CreateBooleanDifference(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double)
Compute the Solid Difference of two Breps.
firstBrep: First Brep for boolean difference.
secondBrep: Second Brep for boolean difference.
tolerance: Tolerance to use for difference operation.
Returns: An array of Brep results or null on failure.