Rhino.Display.RhinoView.FloatRhinoView(System.Boolean)
Change floating state of RhinoView
floating:
if true, then the view will be in a floating frame window. Otherwise
the view will be embeded in the main frame.
Returns: true on success.

Rhino.Display.RhinoView.IsFloatingRhinoView
Used by Rhino main frame and doc/view manager to determine if this view is
in a floating frame or a child of the MDIClient window associated with the
Rhino main frame window.
Returns true If this view is in a free floating frame window.