Rhino.Render.Sun.SetPosition(System.Double,System.Double)
Sets position of the Sun based on azimuth and altitude values.
azimuthDegrees: The azimut sun angle in degrees.
altitudeDegrees: The altitude sun angle in degrees.

Rhino.Render.Sun.SetPosition(System.DateTime,System.DateTimeKind,System.Double,System.Double)
This method is obsolete. Do not use this method. This method is hidden from autocompletion.
when: -
whenKind: -
latitudeDegrees: -
longitudeDegrees: -

Rhino.Render.Sun.SetPosition(System.DateTime,System.Double,System.Double)
Sets position of the sun based on physical location and time.
when: A datetime instance.
If the date Kind is DateTimeKind.Local,
or DateTimeKind.Unspecified, the date is considered local.
latitudeDegrees: The latitude, in degrees, of the location on Earth.
longitudeDegrees: The longitude, in degrees, of the location on Earth.

Rhino.Render.Sun.Enabled
Turn to sun on/off in this document.