Rhino.Geometry.Mesh.UnifyNormals
Attempts to fix inconsistencies in the directions of meshfaces for a mesh. This function
does not modify the vertex normals, but rather rearranges the mesh face winding and face
normals to make them all consistent. You may want to call Mesh.Normals.ConputeNormals()
to recompute vertex normals after calling this functions.
Returns: number of faces that were modified.