Rhino.DocObjects.Tables.InstanceDefinitionTable.GetList(System.Boolean)
Gets an array of layers.
ignoreDeleted: If true then deleted layers are filtered out.
Returns: An array of layers. This can be empty, but not null.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Item(System.Int32)
Conceptually, the InstanceDefinition table is an array of Instance definions.
The operator[] can be used to get individual instance definition. An instance
definition is either active or deleted and this state is reported by IsDeleted.
index: zero based array index.
Returns: The instance definition at the specified index.