Rhino.RhinoApp.RunScript(System.String,System.Boolean)
Runs a Rhino command script.
script: [in] script to run.
echo:
Controls how the script is echoed in the command output window.
false = silent - nothing is echoed.
true = verbatim - the script is echoed literally.
Remarks:
Rhino acts as if each character in the script string had been typed in the command prompt.
When RunScript is called from a "script runner" command, it completely runs the
script before returning. When RunScript is called outside of a command, it returns and the
script is run. This way menus and buttons can use RunScript to execute complicated functions.

Rhino.RhinoApp.MainWindow
Gets the Window32 interface handle of the main window.
Returns: A interface to the handle.