Rhino.Geometry.Curve.PlanarClosedCurveContainmentTest(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Plane,System.Double)
Determines whether two coplanar simple closed curves are disjoint or intersect;
otherwise, if the regions have a containment relationship, discovers
which curve encloses the other. This method is obsolete and will be removed in future versions of the SDK.
curveA: A curve.
curveB: Another curve.
testPlane: A valid plane containing the curves.
tolerance: A tolerance value for intersection.
Returns:
A value indicating the relationship between the first and the second curve.
0: regions bounded by the curves are disjoint.
1: curves intersect.
2: region bounded by curveA is inside of curveB.
3: region bounded by curveB is inside of curveA.