GH_IO.Serialization.GH_Archive.MessageCount(System.Boolean,System.Boolean,System.Boolean)
Gets the number of messages recorded since the most recent IO operation began.
Message count can be filtered by message type.
bIncludeInfo: If true, info messages will be included in the count.
bIncludeWarnings: If true, warnings will be included in the count.
bIncludeErrors: If true, errors will be included in the count.
Returns: The number of recoded messages that pass the type filters.