Grasshopper.Kernel.GH_Component.GH_StructureIterator.GH_StreamTarget.path
Represents the current output path for new data.
This path will be incremented during IncrementBranchIndices

Grasshopper.Kernel.GH_Component.GH_StructureIterator.GH_StreamTarget.index
Represents the current index in the current path where new data will be stored.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.GH_StreamTarget.extruded
If the current path has already been extruded, m_extruded[i] will be True.
If a path has been extruded, the path field of this instance will be incomplete.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.GH_StreamTarget.ResetExtrudedFlags(System.Int32)
Set all extruded flags to False.
N: Number of flags to set. This number represents the number of output parameters.