Grasshopper.Kernel.GH_Component.GH_InputParamManager.ParamCount
Returns the number of input parameters already registered with this component.
Returns:
Remarks:

Grasshopper.Kernel.GH_Component.GH_InputParamManager.Param(System.Int32)
Returns the input parameter at the index locus
index:
Returns:
Remarks:

Grasshopper.Kernel.GH_Component.GH_InputParamManager.RegisterParam(Grasshopper.Kernel.IGH_Param)
Generic parameter registration. This class provides methods to register standard parameters,
but if you have a custom type you have to use this generic function.
iParam: The parameter to add.

Grasshopper.Kernel.GH_Component.GH_InputParamManager.HideParameter(System.Int32)
Hide a specific input parameter. If the parameter at the given index implement IGH_PreviewObject
then the Hidden flag will be set to True. Otherwise, nothing will happen.
index: Index of parameter to hide.