Grasshopper.Kernel.GH_Param`1.RegisterRemoteIDsUtil(Grasshopper.Kernel.GH_IdTable)
Utility function which treats all data in the Volatile cache as IGH_GeometricGoo
and registers all referenced objects. Call this function from within RegisterRemoteIDs()
if you are absolutely sure that all the items in volatiledata implement IGH_GeometricGoo.