Grasshopper.GUI.GH_TooltipDisplayEventArgs.FuzzRadius
Gets or sets the Fuzz radius to apply once the tooltip is shown.

Grasshopper.GUI.GH_TooltipDisplayEventArgs.FuzzRegion
Gets or sets the Fuzz region to apply once the tooltip is shown.