Grasshopper.Kernel.Types.GH_UserData.UD_Type
Gets the Type description of the GH_UserData class.

Grasshopper.Kernel.Types.GH_UserData
Grasshopper user data dictionary. User data is currently not yet supported.