Grasshopper.GUI.Canvas.GH_PaletteStyle.CreateBrush(System.Drawing.RectangleF,System.Single)
Create a fill brush.
rec: Target rectangle of fill brush.
zoom: Zoom level of target graphics surface.
Returns: A brush object that can be used to fill a custom area.