Grasshopper.Kernel.GH_FolderWatcher.#ctor(System.String,System.String,System.Boolean)
Create a new folder watcher.
folder_path: Folder to watch.
file_filter: Filter string for files to include. Use String.Empty for no filtering.
activate: If true, the watcher will be active right away.

Grasshopper.Kernel.GH_FolderWatcher.FileCreatedDelegate
Gets or sets the delegate subroutine that will be invoked upon a File Added event.

Grasshopper.Kernel.GH_FolderWatcher.FileDeletedDelegate
Gets or sets the delegate subroutine that will be invoked upon a File Removed event.

Grasshopper.Kernel.GH_FolderWatcher.FileRenamedDelegate
Gets or sets the delegate subroutine that will be invoked upon a File Renamed event.

Grasshopper.Kernel.GH_FolderWatcher.FileChangedDelegate
Gets or sets the delegate subroutine that will be invoked upon a File Changed event.

Grasshopper.Kernel.GH_FolderWatcher.Active
Gets or sets the active flag on this watcher.

Grasshopper.Kernel.GH_FolderWatcher.Folder
Gets the folder path currently being watched.

Grasshopper.Kernel.GH_FolderWatcher
Provides easy mechanisms to monitor changes to a local folder.