Grasshopper.Kernel.GH_Component.m_param_server
Parameter server for this Component.

Grasshopper.Kernel.GH_Component.#ctor(System.String,System.String,System.String,System.String,System.String)
Constructor for this component. This function will call the PostConstructor which will initialize the parameters
sName: The name of this component. Keep it short, single words are best.
sAbbreviation: The abbreviation of this component. Keep it short, 1~5 character words are best.
sDescription: The description of this component. Be succinct but clear. You can supply whole sentences.
sCategory: The category of this component. The category controls in which tab the component will end up.
sSubCategory: the SubCategory for this component. The SubCategory controls in which panel the component will end up.

Grasshopper.Kernel.GH_Component.DependsOn(Grasshopper.Kernel.IGH_ActiveObject)
Returns True is any one of my input parameters depends on the source.
PotentialSource: Source to test for dependency.

Grasshopper.Kernel.GH_Component.RegisterRemoteIDs(Grasshopper.Kernel.GH_IdTable)
Registers all my input parameters with the UUID_LookUpTable
iList:
Remarks: