Grasshopper.Kernel.GH_SettingsServer.GlobalSettingsFolder
Gets the folder into which all Grasshopper settings are stored.
This folder might not exist.

Grasshopper.Kernel.GH_SettingsServer.IsGlobalSettingsFolder
Gets a value indicating whether or not the Global Settings folder exists.

Grasshopper.Kernel.GH_SettingsServer.ShowSettingsFolder
Opens the Global settings folder (if it exists) in Windows Explorer.

Grasshopper.Kernel.GH_SettingsServer.#ctor(System.String)
Create a new instance of the GH_SettingsServer class. The server
will be associated with a settings xml file in the %ApplicationData%\Grasshopper\ directory.
If a file with the same name already exists, its settings will be automatically loaded.
settings_database_name: The name of the settings server
(equals the name of the xml file so it must adhere to FAT, FAT32 and NTFS naming conventions).