Grasshopper.Kernel.Gradient.GH_Gradient.#ctor(System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Drawing.Color})
Create a new gradient from grips and colours.
grips: Grip locations.
colours: Colours for each grip.

Grasshopper.Kernel.Gradient.GH_Gradient.MouseDown(System.Drawing.RectangleF,System.Drawing.PointF)
Begin grip drag
dest: Destination rectangle of the gradient
pt: Mouse position in destination coordinates
Returns: True if a grip drag was started, false otherwise

Grasshopper.Kernel.Gradient.GH_Gradient.MouseMove(System.Drawing.RectangleF,System.Drawing.PointF)
Continue grip drag.
dest: Destination rectangle of gradient
pt: Mouse position in destination coordinates
Returns: True if a grip position was changed, false otherwise. Redraws are only required on TRUE

Grasshopper.Kernel.Gradient.GH_Gradient.MouseUp(System.Drawing.RectangleF,System.Drawing.PointF)
Terminate grip drag.
dest: Destination rectangle of gradient
pt: Mouse location in destination coordinates

Grasshopper.Kernel.Gradient.GH_Gradient
