Grasshopper.GUI.Canvas.GH_Canvas.RemoveTagArtist(System.Guid)
Remove all IGH_TagArtists from this canvas that match a certain ID.
artist_id: ID of IGH_TagArtists to remove.
Returns: The number of IGH_TagArtist instances removed.