Grasshopper.GUI.RemotePanel.IGH_RCP_ParentControl.Document
Gets or sets the document that is represented in this Frontend.

Grasshopper.GUI.RemotePanel.IGH_RCP_ParentControl.EditMode
Gets or sets a boolean that indicates whether the frontend is in Edit mode.
While in Edit Mode, new containers may be created, existing containers may be
deleted and re-arranged and nodes may be deletes and rearranged.

Grasshopper.GUI.RemotePanel.IGH_RCP_ParentControl.Groups
Gets all the top-level groups in the frontend.

Grasshopper.GUI.RemotePanel.IGH_RCP_ParentControl
Implement this interface in any control which is supposed to display RCP objects.
But let's face it, you don't want to make your own control that displays RCP objects,
you want to use the RCP_FrontEnd control.