Grasshopper.Kernel.GH_DocumentContext.None
Specifies unset state. This is never used.

Grasshopper.Kernel.GH_DocumentContext.Focus
Indicates the document has been loaded into the Canvas.

Grasshopper.Kernel.GH_DocumentContext.Defocus
Indicates the document has been unloaded from the Canvas.