Grasshopper.GUI.GH_GraphicsUtil.RenderObjectOverlay(System.Drawing.Graphics,Grasshopper.Kernel.GH_ObjectProxy,System.Drawing.RectangleF)
Render all overlay icons for a specific object.
Overlays aren't drawn when the zoom is less than 80%
graphics: Graphics object to draw with.
obj: Proxy to draw overlay for.
target: Destination area for overlay icons.

Grasshopper.GUI.GH_GraphicsUtil.RenderFadedImage(System.Drawing.Graphics,System.Drawing.Bitmap,System.Drawing.Rectangle,System.Double)
Render an icon into a rectangle with a specific fading factor.
graphics: Graphics object to draw with.
image: Image to draw.
destination: Destination rectangle.
fade: Fading amount. 0.0=completely transparent, 1.0=original transparency.