Grasshopper.Kernel.GH_Format.ScientificFormattingThreshold_Large
Gets or sets the upper threshold above which numbers are formatted using scientific notation.

Grasshopper.Kernel.GH_Format.ScientificFormattingThreshold_Small
Gets or sets the lower threshold above which numbers are formatted using scientific notation.