Grasshopper.Kernel.GH_ObjectProxy.Location
Gets the location of the source object. If the proxy represents a Compiled Object,
the location refers to the file path of the assembly, in the case of User Objects,
the location refers to the object file.

Grasshopper.Kernel.GH_ObjectProxy.LibraryGuid
Gets the ID of the library (GHA file) that defines this object.

Grasshopper.Kernel.GH_ObjectProxy.Icon
Gets the icon of the object.

Grasshopper.Kernel.GH_ObjectProxy.Desc
Gets the Instance Description associated with this proxy.

Grasshopper.Kernel.GH_ObjectProxy.Type
Gets the Type code for the object. If the proxy references a User Object,
the Type members will be null.

Grasshopper.Kernel.GH_ObjectProxy.Kind
Gets the kind of the Proxy source object.

Grasshopper.Kernel.GH_ObjectProxy.Guid
Gets the Guid of the object. In the case of Compiled Objects,
the Guid represents the ComponentID, in the case of User Objects,
the Guid is an MD5 hash of the file path.

Grasshopper.Kernel.GH_ObjectProxy.Exposure
Gets the Exposure of this object.

Grasshopper.Kernel.GH_ObjectProxy.Compliant
Gets whether this object is compliant with the current Rhino version.

Grasshopper.Kernel.GH_ObjectProxy.Obsolete
Gets whether this proxy represents an obsolete object.
Obsolete objects either have the string "OBSOLETE" in their class name or
have been decorated with the Obsolete Attribute.

Grasshopper.Kernel.GH_ObjectProxy.CreateNewInstance
Create a new instance from the Proxy source.
Returns: An IGH_DocumentObject instance on success or null on failure.

Grasshopper.Kernel.GH_ObjectProxy
