Grasshopper.Global_Proc.ASSERT(System.Guid)
Display a typical ASSERT dialog with stack information.
assert_id: ID of assert message. Every ASSERT must have a unique ID so individual messages can be ignored.

Grasshopper.Global_Proc.ASSERT(System.Guid,System.String)
Display a typical ASSERT dialog with stack information.
assert_id: ID of assert message. Every ASSERT must have a unique ID so individual messages can be ignored.
message: The text to display as the ASSERT message.

Grasshopper.Global_Proc.ASSERT(System.Guid,System.Exception)
Display a typical ASSERT dialog with stack information.
assert_id: ID of assert message. Every ASSERT must have a unique ID so individual messages can be ignored.
exception: Exception object to harvest further information from.

Grasshopper.Global_Proc.ASSERT(System.Guid,System.String,System.Exception)
Display a typical ASSERT dialog with stack information.
assert_id: ID of assert message. Every ASSERT must have a unique ID so individual messages can be ignored.
message: The text to display as the ASSERT message.
exception: Exception object to harvest further information from.

Grasshopper.Global_Proc.Version
Gets the version of the current build of Grasshopper.

Grasshopper.Global_Proc.VersionString
Gets the version of the current build of Grasshopper.

Grasshopper.Global_Proc.BuildDate
Gets the build date string. This is the visible release iteration tag.
Typically the BuildDate is just the date (MMMM-dd, yyyy), but it may carry a prefix or suffix for special builds.

Grasshopper.Global_Proc.Beep(System.Int32,System.Int32)
Beeps are only active in Grasshopper DEBUG builds.
Frequency: Beep sound frequency.
Duration: Beep sound duration (in milliseconds)

Grasshopper.Global_Proc.Beep(System.Int32,System.Int32,System.UInt32)
Beeps are only active in Grasshopper DEBUG builds.
Frequency: Beep sound frequency.
Duration: Beep sound duration (in milliseconds)
Repeats: Number of repeats.

Grasshopper.Global_Proc.Beep(System.Int32[],System.Int32)
Beeps are only active in Grasshopper DEBUG builds.
Frequencies: A list of beep sound frequencies.
Duration: Duration of each individual frequency.

Grasshopper.Global_Proc.IIf``1(System.Boolean,``0,``0)
Type safe implementation of the IIf conditional statement.
Type of statement.
condition: If True, A is returned.
A: Value to return when condition evaluates to true.
B: Value to return when condition evaluates to false.

Grasshopper.Global_Proc.InvokeMethod(System.Object,System.String)
Call a method via its name.
target: Object to invoke on.
method: Name of method to invoke.
Returns: The return value of the method.

Grasshopper.Global_Proc.InvokeMethod(System.Object,System.String,System.Object[])
Call a method via its name.
target: Object to invoke on.
method: Name of method to invoke.
params: Arguments for method.
Returns: The return value of the method.

Grasshopper.Global_Proc.InvokeMethodSafe(System.Object,System.String)
Call a method via its name. No exceptions are thrown.
target: Object to invoke on.
method: Name of method to invoke.
Returns: The return value of the method.

Grasshopper.Global_Proc.InvokeMethodSafe(System.Object,System.String,System.Object[])
Call a method via its name. No exceptions are thrown.
target: Object to invoke on.
method: Name of method to invoke.
params: Arguments for method.
Returns: The return value of the method.

Grasshopper.Global_Proc.InvokeGetter(System.Object,System.String)
Call a getter property via its name.
target: Object to invoke on.
property: Name of property to invoke.
Returns: The return value of the method.

Grasshopper.Global_Proc.InvokeGetterSafe(System.Object,System.String)
Call a getter property via its name.  No exceptions are thrown.
target: Object to invoke on.
property: Name of property to invoke.
Returns: The return value of the method.

Grasshopper.Global_Proc.InvokeSetter(System.Object,System.String,System.Object)
Call a setter property via its name.
target: Object to invoke on.
property: Name of property to invoke.

Grasshopper.Global_Proc.InvokeSetterSafe(System.Object,System.String,System.Object)
Call a setter property via its name.  No exceptions are thrown.
target: Object to invoke on.
property: Name of property to invoke.

Grasshopper.Global_Proc.Ping(System.String)
Ping() is only available in Grasshopper DEBUG builds.
msg: Message to display.

Grasshopper.Global_Proc.Ping(System.String,System.Int32)
Ping() is only available in Grasshopper DEBUG builds.
msg: Message to display.
duration: Duration (in milliseconds) of message.

Grasshopper.Global_Proc.lf
NewLine constant.

Grasshopper.Global_Proc.Settings
Represents the global, default settings database.

Grasshopper.Global_Proc
Global module that provides access to Grasshopper ASSERT logic.