Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderGrips(System.Drawing.Graphics,System.Single)
Render all the grips associates with the capsule.
Grips are not drawn if the zoom level is less than 50%.
This is usually the first stage in a Capsule rendering.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderGrips_Alternative(System.Drawing.Graphics,System.Single)
Render all the grips associates with the capsule as semi-circles.
This is needed if the capsule background is not fully opaque.
Grips are not drawn if the zoom level is less than 50%.
This is usually the first stage in a Capsule rendering.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderBackground_Alternative(System.Drawing.Graphics,System.Drawing.Color,System.Boolean)
Render a custom capsule background fill. This is usually the third stage in a capsule rendering.
G: Graphics object to draw with.
colour_override: Custom background colour.
draw_alphagrid: If true, and the background colour is not opaque,
an alpha grid will be drawn as well.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderHighlight(System.Drawing.Graphics,System.Single)
Render a highlight bar. This is highly zoom-dependant.
Highlight rendering is usually the fourth stage in a Capsule Rendering,
after the background but prior to the edges.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderText(System.Drawing.Graphics,System.Single,System.Drawing.Color)
Render the capsule text.
This is usually the sixth and final stage in a capsule rendering.
G: Graphics object to draw with.
zoom: Zoom factor. If the zoom-factor is so small that the Font becomes illegible, no text is drawn.
colour: Colour of text.

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderIcon(System.Drawing.Graphics,System.Drawing.Image,System.Drawing.Drawing2D.InterpolationMode,System.Single,System.Int32,System.Int32)
Render an image icon centered into the box. If the content box has been defined the icon
will be centered there, otherwise the outline box will be used.
G: Graphics surface to draw onto.
icon: Icon to draw.
interpolation: Pixel interpolation mode (if the graphics zoom is 100%, the interpolation mode is always NearestNeighbor.
zoom_cutoff: Zoom threshold, if the zoom factor of the Graphics surface is less than the cutoff, the icon is not drawn.
x_offset: Additional x-offset (in original pixel units).
y_offset: Additional y-offset (in original pixel units).

Grasshopper.GUI.Canvas.GH_CapsuleRenderEngine.RenderIcon(System.Drawing.Graphics,System.Drawing.Image,System.Drawing.RectangleF,System.Drawing.Drawing2D.InterpolationMode,System.Single,System.Int32,System.Int32)
Render an image icon centered into the box. If the content box has been defined the icon
will be centered there, otherwise the outline box will be used.
G: Graphics surface to draw onto.
icon: Icon to draw.
box: Box override.
interpolation: Pixel interpolation mode (if the graphics zoom is 100%, the interpolation mode is always NearestNeighbor.
zoom_cutoff: Zoom threshold, if the zoom factor of the Graphics surface is less than the cutoff, the icon is not drawn.
x_offset: Additional x-offset (in original pixel units).
y_offset: Additional y-offset (in original pixel units).