Grasshopper.Kernel.Data.IGH_Structure.IsEmpty
Gets the Empty state of the structure. If the structure is Empty it contains no paths and no branches.

Grasshopper.Kernel.Data.IGH_Structure.PathIndex(Grasshopper.Kernel.Data.GH_Path,System.Int32@,System.Int32@)
Find the indices that delineate the given path domain.
path: Path to search for (it need not exist in the structure).
idx0: The index of the path itself or the first smaller path if the path is not defined.
idx1: The index of th path itself of the first larger path if the path is not defined.

Grasshopper.Kernel.Data.IGH_Structure.Graft(System.Boolean)
Grafts all paths by reallocating all data into child paths.
clear_single_nulls: If true, nulls will not be grafted.

Grasshopper.Kernel.Data.IGH_Structure.Graft(Grasshopper.Kernel.Data.GH_Path,System.Boolean)
Grafts a specific path by reallocating all data into child paths.
If a grafted path coincides with an existing path,
the data item in question will be appended to the existing path.
path: Path of data to graft.
clear_single_nulls: If true, nulls will not be grafted.

Grasshopper.Kernel.Data.IGH_Structure.Flatten(Grasshopper.Kernel.Data.GH_Path)
Flattens the entire structure into a single path.
flat_path: The path of the flattened data. If null, the path will be {0}