Grasshopper.Kernel.Special.GH_Group.RecreateIDListFromObjectInstanceCache
Recreates the list of Object IDs based on the current cached objects.
This function is useful when object IDs have been mutated.
Before you call this function you must make sure the Object Instance Cache has been created.