Grasshopper.Kernel.IGH_DocumentObject.OnSolutionExpired(System.Boolean)
Raises the SolutionExpired event on the toplevel object.
bRecompute: If True, the solution will be immediately recalculated.

Grasshopper.Kernel.IGH_DocumentObject.ExpireSolution(System.Boolean)
Call this function whenever you do something which expires the current solution.
This will make sure all caches are erased, all downstream objects are expired and that
the event is raised.
The default implementation merely places a call to OnSolutionExpired(), override this function
in derived classes to make sure you clear local data caches and expire downstream objects.
bRecompute: If True, the solution will be recomputed straight away.

Grasshopper.Kernel.IGH_DocumentObject.OnObjectChanged(Grasshopper.Kernel.GH_ObjectEventType)
Raises the ObjectChanged event on the current (!not the top level!) object.
event_type: Type of change.

Grasshopper.Kernel.IGH_DocumentObject.OnObjectChanged(System.String)
Raises the ObjectChanged event on the current (!not the top level!) object.
custom_event: Custom change type name.

Grasshopper.Kernel.IGH_DocumentObject.OnObjectChanged(Grasshopper.Kernel.GH_ObjectEventType,System.Object)
Raises the ObjectChanged event on the current (!not the top level!) object.
event_type: Type of change.
tag: Tag to apply to the event arguments.

Grasshopper.Kernel.IGH_DocumentObject.OnObjectChanged(System.String,System.Object)
Raises the ObjectChanged event on the current (!not the top level!) object.
custom_event: Custom change type name.
tag: Tag to apply to the event arguments.