Grasshopper.Kernel.GH_Component.GH_StructureIterator.#ctor(Grasshopper.Kernel.GH_Component)
Create a new structure iterator.
You must call IncrementBranchIndices() prior to using this iterator.
parent: Owner component of this iterator. Cannot be null.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_stream
Represents the data targets (paths and indices) of the current operation.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_paramCount
Number of input parameters of the parent component.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_paramListCount
Number of List input parameters of the parent component.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_paramAccess
List flag for each parameter.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_branchLength
List length for each current branch.
If the branch is null, the length is set to 0.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_itemIndex
List of item indices for the current iteration.
List parameters do not have meaningful indices.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_branchIndex
A list of branch indices for the current iteration.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_branchRef
A list of branch references that point to the currently active branches as defined by m_list_index.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.m_paramSet
A list of booleans that records setter history for the current iteration.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.VolatileData(System.Int32)
Gets a pointer to the volatile data of the input parameter at the specified index
index: Index of input parameter. Must be valid

Grasshopper.Kernel.GH_Component.GH_StructureIterator.Parameter(System.Int32)
Gets a pointer to the input parameter at the specified index.
index: Index of input parameter. Must be valid

Grasshopper.Kernel.GH_Component.GH_StructureIterator.IncrementStreamPath
Increment the stream path.
If there are no input parameters, the path root is incremented.
If there is only a single input param, that path is copied.
If there is only a single connected input param, that path is copied.
If there are multiple connected input params, the most complex path is copied.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.FindMasterParameter(System.Int32@)
Attempts to find the most important input parameter that controls the path of the
output data.
index: Index of master parameter (if found, otherwise -1)
Returns: True if a master parameter is found, otherwise false.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.SingleConnectedParameter
Returns a pointer to the parameter which is the only connected one.
If no parameters are connected or if two or more parameters are connected,
null is returned.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.MostComplexParameter
Returns a pointer to the most complex parameter.
This is either the parameter with the longest paths,
or it is the parameter with the the most branches.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.UpdateBranchReference(System.Int32)
This will update the cached reference and length of branch at the given parameter index (layer).
The m_branch_index(layer) value must be correct before calling this function.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.UpdateBranchLength(System.Int32)
Updates the branch length cache for a given branch index (layer).
Before you call this function make sure that the m_branch_ref field is already up to date.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.DisableGapLogic
Call this function if you want to disable the gap null logic for the current iteration.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.DisableGapLogic(System.Int32)
Call this function if you want to disable the gap null logic for a specific output parameter.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.ParameterTargetPath(System.Int32)
Get the target path for the specified output parameter.
paramIndex: Index of output parameter.

Grasshopper.Kernel.GH_Component.GH_StructureIterator.ParameterTargetIndex(System.Int32)
Get the target index for the specified output parameter.
paramIndex: Index of output parameter.