Grasshopper.Kernel.GH_ComponentServer.GHA_Directories
Gets a list of all the directories from which GHA assemblies are loaded.
This list may contain folder paths that do not point to existing folders
or indeed valid paths. You should test each folder path using System.IO.Directory.Exists()
Returns: A list of load target directories.

Grasshopper.Kernel.GH_ComponentServer.GHA_AppDataDirectory
Gets the directory in windows ApplicationData that contains 3rd party GHA files.
Returns: A directory path.

Grasshopper.Kernel.GH_ComponentServer.GHUSER_AppDataDirectory
Gets the directory that contains the GHUSER files.
Returns: A directory path.

Grasshopper.Kernel.GH_ComponentServer.AllAddOns
Gets a list of all the gha, ghuser and dll files that will be loaded as Grasshopper add-ons.
Returns: A list of target file paths.

Grasshopper.Kernel.GH_ComponentServer.LoadAddOns
Attempt to parse all GHA Assemblies and User Objects.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentServer.LoadAddOns(System.Collections.Generic.List{System.String})
Parse all assemblies that can potentially contain Grasshopper classes, including this one.
All files with the extension *.ehc in the Components folder are included
addons: List of add-on files to parse.

Grasshopper.Kernel.GH_ComponentServer.LoadAddOn(System.String)
Load a GHA or GHUSER file from a certain location.
path: Path to load from.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_ComponentServer.LoadGHA(System.String)
Load a GHA assembly from the disk, using the currently active loading mechanism
(LoadFrom(path) or Load(coff).
path: The uri of the assembly file.
Returns: The loaded assembly.

Grasshopper.Kernel.GH_ComponentServer.CopyFileToRoamingFolder(System.String)
Copy a GHA or GHUSER file into the appropriate Roaming Application Data folder.
Of the file is already in the top-level roaming folder it will not be copied.
filepath: The file to copy.
Returns: The path of the copied file.

Grasshopper.Kernel.GH_ComponentServer.ConflictSolutionPrompt(Grasshopper.Kernel.GH_ObjectProxy,Grasshopper.Kernel.GH_ObjectProxy,Grasshopper.Kernel.GH_GuidConflictSolution@)
Displays the GUID conflict dialog for types A and B.
A: The resident instance.
B: The conflicting instance.
solution: the current solution value. If solution equals ReplaceAll or SkipAll the dialog is not displayed.

Grasshopper.Kernel.GH_ComponentServer.ShowGHAAssemblyFolders
Opens all the GHA Assembly folders (if they exist) in Windows Explorer.

Grasshopper.Kernel.GH_ComponentServer.ShowUserObjectFolder
Opens the User Object folder (if it exists) in Windows Explorer.

Grasshopper.Kernel.GH_ComponentServer.ShowDefaultGHAFolder
Opens the 3rd party GHA folder (if it exists)

Grasshopper.Kernel.GH_ComponentServer.LibraryID(Grasshopper.Kernel.GH_AssemblyInfo)
Get the ID of a specific library.
info: The AssemblyInfo object describing the library to find.
Returns: The ID of the library or Guid.Empty if no matching library could be found.

Grasshopper.Kernel.GH_ComponentServer.DestroyIconCache(System.Guid)
Destroy the icon cache of a specific proxy object.
id: Guid of object.