Grasshopper.Kernel.GH_Component.GH_OutputParamManager.RegisterParam(Grasshopper.Kernel.IGH_Param)
Generic parameter registration. This class provides methods to register standard parameters,
but if you have a special type you're in charge of setting it all up yourself.
iParam: The parameter to add

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.RegisterParam(Grasshopper.Kernel.IGH_Param,System.String,System.String,System.String)
Generic parameter registration. This class provides methods to register standard parameters,
but if you have a special type you're in charge of setting it all up yourself.
iParam: The parameter to add
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks:

Grasshopper.Kernel.GH_Component.GH_OutputParamManager.Register_IntervalParam(System.String,System.String,System.String)
Register a new OnInterval parameter
name: The name of the parameter. Keep it short, single words are best.
nickname: The nickname of the parameter. Keep it short, single characters are best.
description: The description of the parameter. Be succinct but clear.
Remarks: