Grasshopper.GUI.GH_MouseTracker.#ctor(System.Windows.Forms.MouseButtons,System.Drawing.Point)
Create a new mouse tracker.
mouse_buttons: Buttons that are pressed as of now.
initial_point: First point in tracker.

Grasshopper.GUI.GH_MouseTracker.#ctor(System.Windows.Forms.MouseButtons,System.Drawing.Point,System.Object)
Create a new mouse tracker.
mouse_buttons: Buttons that are pressed as of now.
initial_point: First point in tracker.
initial_tag: First tag in tracker.

Grasshopper.GUI.GH_MouseTracker.MaximumDeviation
Gets the maximum deviation of the recorded mouse path.
The maximum deviation is the furthest distance the mouse has been
from the first point in the history record.

Grasshopper.GUI.GH_MouseTracker.StartTime
Gets the time at which recording began.

Grasshopper.GUI.GH_MouseTracker.Duration
Gets the timespan that has passed between the first and the last recorded frame.
This is not the same as the time that has passed since recording began.

Grasshopper.GUI.GH_MouseTracker.Position
Gets the list of cursor locations for all recorded frames.

Grasshopper.GUI.GH_MouseTracker.ScreenPosition
Gets the list of cursor locations in screen coordinates for all recorded frames.

Grasshopper.GUI.GH_MouseTracker.Events
Gets the list of time stamps for all recorded frames.

Grasshopper.GUI.GH_MouseTracker.Modifiers
Gets the list of modifier key data for all recorded frames.

Grasshopper.GUI.GH_MouseTracker.Tags
Gets the list of tags for all recorded frames.

Grasshopper.GUI.GH_MouseTracker.Tag``1(System.Int32)
Retrieves (and casts) the tag at the given index.
Type of tag.
index: Index of tag.
Returns: The tag at the given index, cast to type T.
Throws System.InvalidCastException: Thrown if the T generic parameter does not match the tag Type.

Grasshopper.GUI.GH_MouseTracker.LastPosition
Gets the most recent cursor position in recorded history.

Grasshopper.GUI.GH_MouseTracker.LastScreenPosition
Gets the most recent cursor position in screen coordinates in recorded history.

Grasshopper.GUI.GH_MouseTracker.LastEvent
Gets the most recent time-stamp in recorded history.

Grasshopper.GUI.GH_MouseTracker.LastModifier
Gets the most recent Modifier Key data in recorded history.

Grasshopper.GUI.GH_MouseTracker.LastTag
Gets the most recent cursor position in screen coordinates in recorded history.

Grasshopper.GUI.GH_MouseTracker.Record(System.Drawing.Point)
Record a new mouse event frame.
pt: Cursor location of new frame.

Grasshopper.GUI.GH_MouseTracker.Record(System.Drawing.Point,System.Object)
Record a new mouse event frame.
pt: Cursor location of new frame.

Grasshopper.GUI.GH_MouseTracker
This class is used to record mouse-movements over time.