Grasshopper.GH_InstanceServer.UnloadAllObjects
Clears and unloads all cached objects. This function is called by the
_GrasshopperUnloadPlugin command. Please don't use it.

Grasshopper.GH_InstanceServer.RcpDockBar
Gets the app-domain wide RCP dockbar instance.

Grasshopper.GH_InstanceServer.RcpPanel
Gets the app-domain wide RCP panel instance. If it doesn't exist yet it will be created.

Grasshopper.GH_InstanceServer.DebugLogBeginBlock(System.String)
Start a new block in the debug data. You must end all your own blocks.
This function will only work if the Grasshopper window exists. This method is threadsafe.
name: Name of block

Grasshopper.GH_InstanceServer.DebugLogEndBlock
Start a new block in the debug data. You must end all your own blocks.
This function will only work if the Grasshopper window exists. This method is threadsafe.

Grasshopper.GH_InstanceServer.DebugLogAddEntry(System.String)
Add a message to the debug log. If the debug log doesn't exist yet, it will be created.
This function will only work if the Grasshopper window exists. This method is threadsafe.
message: Message to post.

Grasshopper.GH_InstanceServer.CloseDebugLog
Close the debug log stream.
Remarks:

Grasshopper.GH_InstanceServer.IsDocumentEditor
Gets whether the Document Editor has been set.

Grasshopper.GH_InstanceServer.DocumentEditor
Gets or sets the DocumentEditor of Grasshopper.

Grasshopper.GH_InstanceServer.DocumentEditorFadeOut
Calls the FadeOut() method on the DocumentEditor if it exists.

Grasshopper.GH_InstanceServer.DocumentEditorFadeIn
Calls the FadeIn() method on the DocumentEditor if it exists.

Grasshopper.GH_InstanceServer.IsCursorServer
Gets whether the Cursor server has been set.

Grasshopper.GH_InstanceServer.CursorServer
Gets the CursorServer instance cached by the Instance Server.
The CursorServer will be instantiated the first time this property is accessed.

Grasshopper.GH_InstanceServer.IsComponentServer
Gets whether the Component server has been set.

Grasshopper.GH_InstanceServer.ComponentServer
Gets the ComponentServer instance cached by the Instance Server.
The ComponentServer will be instantiated the first time this property accessed.
This is a rather involved process during which the Grasshopper Banner will be displayed.

Grasshopper.GH_InstanceServer.IsMarkovChain
Gets a value indicating whether or not the MarkovChain has already been initialized.

Grasshopper.GH_InstanceServer.MarkovChain
Gets the MarkovChain instance cached by the Instance Server.
The Markov chain will be instantiated if it hasn't been already.

Grasshopper.GH_InstanceServer.IsDocumentServer
Gets whether the Document server has been set.

Grasshopper.GH_InstanceServer.DocumentServer
Gets the DocumentServer instance cached by the Instance Server.
The DocumentServer will be instantiated the first time this property accessed.

Grasshopper.GH_InstanceServer.IsDocumentAssociationServer
Gets whether the Document Association server has been set.

Grasshopper.GH_InstanceServer.DocumentAssociationServer
Gets the Document Association Server instance cached by the Instance Server.
The Document Association Server will be instantiated the first time this property accessed.

Grasshopper.GH_InstanceServer.IsMruServer
Gets a value indicating whether or not the MRU server has been initialized.

Grasshopper.GH_InstanceServer.MruServer
Gets the MRU_Server instance cached by the Instance Server.
The MRU_Server will be instantiated the first time this property accessed.

Grasshopper.GH_InstanceServer.ShowBanner
Gets or sets a value indicating whether or not the banner will be displayed during the ComponentServer Loading process.

Grasshopper.GH_InstanceServer.ActiveCanvas
Gets the currently active Grasshopper canvas (if any)

Grasshopper.GH_InstanceServer.InvalidateCanvas
Invalidates the currently active Grasshopper Canvas, causing a redraw sometime in the foreseeable future.

Grasshopper.GH_InstanceServer.RedrawCanvas
Forces a redraw of the currently active Grasshopper Canvas.

Grasshopper.GH_InstanceServer.RegenCanvas
Forces a redraw of the currently active Grasshopper Canvas.

Grasshopper.GH_InstanceServer.RedrawAll
Forces a redraw of both the active canvas and the Rhino viewports.

Grasshopper.GH_InstanceServer.RegenAll
Forces a redraw of both the active canvas and the Rhino viewports.

Grasshopper.GH_InstanceServer.PluginDirectory
Gets the directory that contains the Grasshopper.dll

Grasshopper.GH_InstanceServer.ToolsDirectory
Gets the directory that contains the additional executables that ship with Grasshopper.

Grasshopper.GH_InstanceServer.DesktopDirectory
Gets the desktop directory of the current user profile.

Grasshopper.GH_InstanceServer.SettingsDirectory
Gets the directory in which global Grasshopper settings are stored.
This is the same as Kernel.GH_SettingsServer.GlobalSettingsFolder

Grasshopper.GH_InstanceServer.MyTypes
Get all the type identifiers that are part of the Grasshopper assembly.
Returns: An array of Type objects.

Grasshopper.GH_InstanceServer.EnforceInvariantCulture
If the Setting "EnforceInvariantCulture" is set to False, this function does nothing
Remarks: