Grasshopper.GUI.RemotePanel.GH_RCP_Control.Document
Gets or sets the document that populates this Control.

Grasshopper.GUI.RemotePanel.GH_RCP_Control
Remote Control Panel. This object is about to become legacy.