Grasshopper.Kernel.Special.GH_PanelAttributes.GH_PanelTextItem.#ctor(System.String,System.Int32,System.Int32,System.Int32,System.Int32,System.Drawing.Color,System.Drawing.Font)
Creates a new text panel item for a data entry.
content: Contents of item.
index: Index of item.
indexColumnWidth: Width (in pixels) of the index column. If indexSize less than or equal to 0 then no indices will be drawn.
colour: Colour for text.
font: Font for text.

Grasshopper.Kernel.Special.GH_PanelAttributes.GH_PanelTextItem.#ctor(Grasshopper.Kernel.Data.GH_Path,System.Int32,System.Int32,System.Drawing.Color,System.Drawing.Font)
Creates a new text panel item for a path entry.
path: Contents of path entry.
colour: Colour for text.
font: Font for text.