Grasshopper.Kernel.IGH_PreviewData.DrawViewportWires(Rhino.Display.RhinoViewport,Rhino.Display.DisplayPipeline,System.Drawing.Color,System.Int32)
Implement this function to draw all wire and point previews.
vp: Viewport to draw in.
pl: Pipeline to draw with.
color: Color to draw object with.
thickness: Thickness in which to draw wires. Not all geometry types support or require this setting.

Grasshopper.Kernel.IGH_PreviewData.DrawViewportMeshes(Rhino.Display.RhinoViewport,Rhino.Display.DisplayPipeline,Rhino.Display.DisplayMaterial)
Implement this function to draw all shaded meshes.
If the viewport does not support shading, this function will not be called.
vp: Viewport to draw in.
pl: Pipeline to draw with.
material: Material for shaded meshes.