Grasshopper.GUI.GH_ZoomFadePhase.Hidden
Indicates the UI elements ought to be hidden.

Grasshopper.GUI.GH_ZoomFadePhase.Hiding
Indicates the UI elements are in the process of being hidden.

Grasshopper.GUI.GH_ZoomFadePhase.Shown
Indicates the UI elements ought to be shown.

Grasshopper.GUI.GH_ZoomFadePhase.Showing
Indicates the UI elements are in the process of being shown.

Grasshopper.GUI.GH_ZoomFadePhase
Enumerates the possible states of a ZUI fade animation.