Grasshopper.Kernel.GH_AssemblyInfo.AssemblyIcon
Gets a 24x24 icon that represents this assembly.
Return null if you do not wish to associate an icon with this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.AssemblyName
Gets the human readable name of this assembly.
Return null if you do not wish to associate a name with this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.AssemblyVersion
Gets the version code for this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.AssemblyDescription
Gets the human readable description of this assembly.
Return null if you do not wish to associate a description with this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.AssemblyLicense
Gets the license type for this assembly.

Grasshopper.Kernel.GH_AssemblyInfo.LicenseToString(Grasshopper.Kernel.GH_LibraryLicense)
Convert a GH_LibraryLicense enumeration into a string.
lic: Flag to convert.
Returns: Human readable string representation of lic.