Grasshopper.GUI.GH_ZoomFadeAnimator.Delay
Gets the number of milliseconds between redraws (25 milliseconds, resulting in ~40 fps)

Grasshopper.GUI.GH_ZoomFadeAnimator.#ctor
Creates a new instance of the Animator class with default settings.

Grasshopper.GUI.GH_ZoomFadeAnimator.#ctor(System.Single)
Create a new instance of the Animator class with custom values for zoom threshold.
threshold: Zoom threshold at which the animation kicks in. The default is 2.0

Grasshopper.GUI.GH_ZoomFadeAnimator.#ctor(System.Single,System.Int32)
Create a new instance of the Animator class with custom values for zoom threshold and duration.
threshold: Zoom threshold at which the animation kicks in. The default is 2.0
duration: The duration (in milliseconds) of the fade animation, the default is 350

Grasshopper.GUI.GH_ZoomFadeAnimator.Threshold
Gets or sets the zooming threshold for the fade animation.

Grasshopper.GUI.GH_ZoomFadeAnimator.Duration
Gets or sets the duration (in milliseconds) for ZUI animations.
Negative durations are not allowed. The default is 350 milliseconds.

Grasshopper.GUI.GH_ZoomFadeAnimator.Phase
Gets the current animation phase.

Grasshopper.GUI.GH_ZoomFadeAnimator.IsFinished
Gets a value indicating whether this animator has finished animating.

Grasshopper.GUI.GH_ZoomFadeAnimator.FadeAlpha
Gets the blend alpha byte for the current state. 0 means fully hidden, 255 means fully shown.

Grasshopper.GUI.GH_ZoomFadeAnimator.FadeFactor
Gets the blend factor for the current state.
0.0 means fully hidden, 1.0 means fully shown.

Grasshopper.GUI.GH_ZoomFadeAnimator.Evaluate(Grasshopper.GUI.Canvas.GH_Canvas)
Reevaluate the fade animation parameters. You should call this
method from within the Render method of your attributes. If an animation
is currently in progress a redraw of the canvas will be scheduled, whether
or not the attributes are actually visible on the canvas. You should therefore
only call this method if your attributes are already drawing themselves.
canvas: Canvas currently drawing in.

Grasshopper.GUI.GH_ZoomFadeAnimator
Utility class for animating fade ZUI events on the canvas.