Grasshopper.Kernel.GH_DocumentServer.AddDocument(Grasshopper.Kernel.GH_Document)
Add a new document to the global list. If the document is already
registered nothing will happen.
doc: Document to add.
Throws System.ArgumentNullException: Thrown when the document is a null reference.

Grasshopper.Kernel.GH_DocumentServer.RemoveDocument(Grasshopper.Kernel.GH_Document)
Removes a specific document from the global list.
If the document isn't registered nothing will happen.
doc: Document to remove.

Grasshopper.Kernel.GH_DocumentServer.PromoteDocument(Grasshopper.Kernel.GH_Document)
Push a document to the top of the list.
doc: Document to promote.