Grasshopper.Kernel.GH_Document.FindAllDownstreamObjects(Grasshopper.Kernel.IGH_ActiveObject)
Find all objects that depend in some way on the Source.

Grasshopper.Kernel.GH_Document.FindAllDownstreamObjects(Grasshopper.Kernel.IGH_ActiveObject,Grasshopper.Kernel.GH_Document.GH_ActiveObjectFilter)
Find all objects that depend in some way on the Source.
filter: The inclusion delegate

Grasshopper.Kernel.GH_Document.FindAllDownstreamObjects(System.Collections.Generic.List{Grasshopper.Kernel.IGH_ActiveObject})
Find all objects that depend in some way on the Source collection
Sources:

Grasshopper.Kernel.GH_Document.FindAllDownstreamObjects(System.Collections.Generic.List{Grasshopper.Kernel.IGH_ActiveObject},Grasshopper.Kernel.GH_Document.GH_ActiveObjectFilter)
Find all objects that depend in some way on the Source collection
Sources:
filter: The inclusion delegate

Grasshopper.Kernel.GH_Document.BoundingBox(System.Boolean)
Returns the boundingbox of all the normal attributes. If the document contains no
normal attributes an Empty RectangleF structure is returned.
bLimitToSelection: If true, only selected attributes are included in the boundingbox computation.
Returns: The boundingbox of the requested objects or RectangleF.Empty if no objects could be found.

Grasshopper.Kernel.GH_Document.AutoSave(Grasshopper.Kernel.GH_AutoSaveTrigger)
Creates a new autosave file on the disk. The previous autosave file (assuming it exists)
will be temporarily renamed and eventually deleted entirely.
Note: AutoSave is only possible on Documents that have TopLevel Rank.
trigger: Reason for autosave. User can choose to ignore certain autosave reasons.

Grasshopper.Kernel.GH_Document.AutoSave(Grasshopper.Kernel.GH_AutoSaveTrigger,System.Guid)
Creates a new autosave file on the disk. The previous autosave file (assuming it exists)
will be temporarily renamed and eventually deleted entirely.
Note: AutoSave is only possible on Documents that have TopLevel Rank.
trigger: Reason for autosave. User can choose to ignore certain autosave reasons.
id: Guid of autosave operation, consecutive calls to autosave with the same Guid will be ignored.

Grasshopper.Kernel.GH_Document.Rank
Gets or sets the Document Rank.

Grasshopper.Kernel.GH_Document.DocumentID
Gets the document ID. The id is assigned at construction and never changed.

Grasshopper.Kernel.GH_Document.ChangeContext(Grasshopper.Kernel.GH_DocumentContext)
Place a call to the DocumentContextChanged() method on all top-level objects.
context: New document context.

Grasshopper.Kernel.GH_Document.Attributes
Returns a list of all normal attributes
Remarks: If the attribute cache is empty, it will be rebuild. Hence, this could be quite an expensive call to make.

Grasshopper.Kernel.GH_Document.MutateAllGUIDs
Change all the instance UUIDs of all objects in the document.
Be sure to resolve all proxy sources before mutating IDs.
This function will ensure all groups are updated appropriately.

Grasshopper.Kernel.GH_Document.Internal_AddObject(Grasshopper.Kernel.IGH_DocumentObject,System.Int32)
Perform basic operations required to add an object to this document.
No events are raised, no updates are triggered.
doc_object: Object to add.
index: Index of object, will be clipped to the valid range automatically.

Grasshopper.Kernel.GH_Document.Internal_RemoveObject(System.Int32)
Perform basic operations required to remove the object at the given index from this document.
No events are raised, no update is triggered.
index: Index of object to remove.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_Document.AddObject(Grasshopper.Kernel.IGH_DocumentObject,System.Boolean,System.Int32)
Add a new object to the document. If the object is already contained, nothing will happen
doc_object: The object to add.
index: Index at which object will be inserted.
update: If True, a new solution will be triggered afterwards, regardless of event response settings.

Grasshopper.Kernel.GH_Document.RemoveObject(Grasshopper.Kernel.IGH_DocumentObject,System.Boolean)
Remove the object from the document. This removal is the precursor to object deletion.
Do not call this function if you intend to transfer the object to another GH_Document.
This method does not add an Undo event, that is the responsibility of the caller.
doc_object: Object to remove.

Grasshopper.Kernel.GH_Document.RemoveObjects(System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_DocumentObject},System.Boolean)
Remove the specified objects from the document. This removal is the precursor to object deletion.
Do not call this function if you intend to transfer the objects to another GH_Document.
This method does not add an Undo event, that is the responsibility of the caller.
objects: Objectss to remove from this document.
update: If True, the solution will be recomputed.
Returns: The number of objects actually deleted.

Grasshopper.Kernel.GH_Document.MergeDocument(Grasshopper.Kernel.GH_Document,System.Boolean)
Hoist all objects from another document into this one.
other: The other document. Cannot be Null or
resolve_proxies: If True, an attempt is made to repair proxy sources after insertion.
Remarks: The objects will be moved, not copied. The other document ends up being empty since objects can only belong to one document at a time.

Grasshopper.Kernel.GH_Document.MergeDocument(Grasshopper.Kernel.GH_Document,System.Boolean,System.Boolean)
Hoist all objects from another document into this one.
other: The other document. Cannot be null.
resolve_proxies: If True, an attempt is made to repair proxy sources after insertion.
clear_proxies: If True, all remaining proxies will be deleted.
Remarks: The objects will be moved, not copied. The other document ends up being empty since objects can only belong to one document at a time.

Grasshopper.Kernel.GH_Document.CreateAutoClusterInputs
Create cluster input objects for this document. Basically all non-optional
input and floating parameters that have no sources and no persistent data will be
'clusterified'.
Returns: A list of all Cluster inputs that were added or null on failure.

Grasshopper.Kernel.GH_Document.CreateAutoClusterOutputs
Create cluster output objects for this document. Basically all floating parameters
without receivers and the unconnected output parameters of the right-most component will be
'clusterified'.
Returns: A list of all Cluster outputs that were added or null on failure.

Grasshopper.Kernel.GH_Document.FileNameProxy
Gets the name of the file from which this document was loaded or unnamed

Grasshopper.Kernel.GH_Document.WriteDocumentAssociations(GH_IO.Serialization.GH_IWriter)
Serialize the associations of this document.

Grasshopper.Kernel.GH_Document.ReadDocumentAssociations(GH_IO.Serialization.GH_IReader)
Deserialize the associations of this document.

Grasshopper.Kernel.GH_Document.ReadObjectList(GH_IO.Serialization.GH_IReader,System.String)
Deserialize a list of IGH_DocumentObjects

Grasshopper.Kernel.GH_Document.SolutionState
Returns the state of this document

Grasshopper.Kernel.GH_Document.SolutionProgress(System.Int32@,System.Int32@)
Returns the progress of the current solution.
obj_index: The index of the object currently being solved
max_index: The highest index.
Returns: Percentage of solution as a number between 1 and 99 inclusive.

Grasshopper.Kernel.GH_Document.IsEscapeKeyDown
Gets the current state of the Escape key.
Returns: True if escape is pressed, false if it is not.

Grasshopper.Kernel.GH_Document.Schedule_CallDelegates
Trigger all callbacks. The callback list will be wiped once the callbacks are complete.

Grasshopper.Kernel.GH_Document.ScheduleTimerTick_ThreadSafe
This method is invoked from the timer thread via the main editor UI thread.