Grasshopper.Kernel.GH_ActiveObject.RegisterRemoteIDs(Grasshopper.Kernel.GH_IdTable)
Override this function if you want object changes in the Rhino document to trigger a new solution.
id_list: The object ID database Grasshopper is responsive to.

Grasshopper.Kernel.GH_ActiveObject.AddRuntimeMessage(Grasshopper.Kernel.GH_RuntimeMessageLevel,System.String)
Add a new message to this object. Valid message type flags are Warning and Error.
If the Message string is empty or zero-length no message is added.
Type: Type of message. Only Warnings and Errors are recorded.
Message: Content of message.