Grasshopper.Kernel.GH_Component.GH_ParamManager.HideParameter(System.Int32)
Hide a specific parameter. If the parameter at the given index implement IGH_PreviewObject
then the Hidden flag will be set to True. Otherwise, nothing will happen.
index: Index of parameter to hide.