Grasshopper.Kernel.GH_PruderyFilter.Unset
Represents an unset filter. If Unset, the user will be asked what level (s)he wishes on startup.

Grasshopper.Kernel.GH_PruderyFilter.None
Default: I'm a well-rounded adult, you don't have to protect me.

Grasshopper.Kernel.GH_PruderyFilter.Low
Everything but the most egregious sexual innuendo is allowed.

Grasshopper.Kernel.GH_PruderyFilter.Medium
Unsubtle sexual/cultural/political content should not appear in this mode.

Grasshopper.Kernel.GH_PruderyFilter.High
Vaguely suggestive cultural/political content is filtered. No sexual references whatsoever.

Grasshopper.Kernel.GH_PruderyFilter.Total
Anything that could even remotely cause offense should not appear.

Grasshopper.Kernel.GH_PruderyFilter
Enumerates the possible level of prudeness for the general User Interface.