Grasshopper.GUI.GH_MenuTextBoxCollection.TextChanged
Raised whenever the text in the textbox changes.
sender: Control raising the event.
nText: New text

Grasshopper.GUI.GH_MenuTextBoxCollection.KeyDown
Raised whenever a key is pressed.
sender: Control raising the event.
e: Key event arguments.

Grasshopper.GUI.GH_MenuTextBoxCollection.#ctor(System.Windows.Forms.ToolStripDropDown,System.String,System.Boolean)
Constructor for TextBox collection.
nDropDown: The menu dropdown into which to embed this textbox control.
nText: The original text to be displayed in the textbox.
bLockFocus: If True, the control will disable the other menu items when it gets focus.

Grasshopper.GUI.GH_MenuTextBoxCollection.Width
Gets or sets the width of the control.

Grasshopper.GUI.GH_MenuTextBoxCollection.OriginalText
Gets or sets the original text that was visible when the control was first displayed.

Grasshopper.GUI.GH_MenuTextBoxCollection.Text
Gets or sets the current text.

Grasshopper.GUI.GH_MenuTextBoxCollection.TextBoxItem
Gets the text box control embedded in the menu.

Grasshopper.GUI.GH_MenuTextBoxCollection.CascadingDropDowns
Gets a list of dropdowns that represent the entire menu structure.

Grasshopper.GUI.GH_MenuTextBoxCollection.CloseEntireMenuStructure
Call this function to close the ENTIRE menu structure.

Grasshopper.GUI.GH_MenuTextBoxCollection
Utility control for putting textboxes into menus.