Grasshopper.Kernel.Special.GH_Cluster.m_doc
Local cluster document.

Grasshopper.Kernel.Special.GH_Cluster.m_input_ids
For every input parameter, we maintain a target ID
of a cluster input gateway inside m_doc.

Grasshopper.Kernel.Special.GH_Cluster.m_output_ids
For every output parameter, we maintain a target ID
of a cluster output gateway inside m_doc.

Grasshopper.Kernel.Special.GH_Cluster.InternalDocument
Gets the internal document for this cluster. Document might be null.

Grasshopper.Kernel.Special.GH_Cluster.AuthorName
Gets or sets the Author Name field for this cluster.

Grasshopper.Kernel.Special.GH_Cluster.AuthorCompany
Gets or sets the Author Company field for this cluster.

Grasshopper.Kernel.Special.GH_Cluster.AuthorContact
Gets or sets the Author Contact field for this cluster.

Grasshopper.Kernel.Special.GH_Cluster.AuthorCopyright
Gets or sets the Author Copyright field for this cluster.

Grasshopper.Kernel.Special.GH_Cluster.CreateFromDocument(Grasshopper.Kernel.GH_Document)
Create a cluster from an entire document.
doc: Document to wrap. The Document will not be copied, so be sure you supply a fresh one.
Returns: True on success, false on failure.

Grasshopper.Kernel.Special.GH_Cluster.CreateFromSelection(Grasshopper.Kernel.GH_Document)
Create a cluster from the selected portion of a document.
doc: Document to harvest selection from. This document will not be touched.
Returns: True on success, false on failure.

Grasshopper.Kernel.Special.GH_Cluster.CreateAllInputs
Parse all Cluster Param objects.

Grasshopper.Kernel.Special.GH_Cluster.CreateAllInputs(Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_ConnectivityDisparity)
Parse all Cluster Param objects and external connections.

Grasshopper.Kernel.Special.GH_Cluster.CreateInput(Grasshopper.Kernel.Special.GH_ClusterInputHook,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param})
Convert a gateway and a collection of sources into a Cluster input.

Grasshopper.Kernel.Special.GH_Cluster.CreateAllOutputs
Parse all Cluster Param objects.

Grasshopper.Kernel.Special.GH_Cluster.CreateAllOutputs(Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_Document,Grasshopper.Kernel.GH_ConnectivityDisparity)
Parse all Cluster Param objects and external connections.

Grasshopper.Kernel.Special.GH_Cluster.CreateOutput(Grasshopper.Kernel.Special.GH_ClusterOutputHook,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.IGH_Param})
Convert a gateway and a collection of recipients to a cluster output.