Grasshopper.Kernel.GH_Convert.String_To_Color(System.String,System.Drawing.Color@)
Converts a String into a Colour.
The string must either be a named colour or a channel mesh-up
S: String to parse.
col: Colour result
Returns: True on success, false on failure.