Grasshopper.Kernel.Special.GH_ControlKnobAttributes.TuningData.InitialOffset
Stores the offset value at the start of tuning.

Grasshopper.Kernel.Special.GH_ControlKnobAttributes.TuningData.CurrentOffset
Total tuning angle since tuning began.

Grasshopper.Kernel.Special.GH_ControlKnobAttributes.TuningData.TuneTrack
Mouse location (in canvas coordinates) at previous tuning frame.

Grasshopper.Kernel.Special.GH_ControlKnobAttributes.TuningData.TuneAngles
Tuning angles for each point in the track.