Grasshopper.GUI.GH_MultilineStringEditor.OnSelectionChanged
Raises the SelectionChanged event.
Remarks: It is safe to call this method often because it will only raise the event if something has truly changed.

Grasshopper.GUI.GH_MultilineStringEditor.SetTargetType(Grasshopper.Kernel.Types.IGH_Goo)
Sets a new default proxy. Defaults are needed to instantiate new values
Remarks: You must set a valid default before you do anything else

Grasshopper.GUI.GH_MultilineStringEditor.SetProxyList(System.Collections.Generic.List{Grasshopper.Kernel.Types.IGH_GooProxy})
Set a list of values. Must be the same type as the default proxy
Remarks: All items will be added to a new list, hence the List will remain unchanged but the values might change

Grasshopper.GUI.GH_MultilineStringEditor.GetProxyList
Gets the list of modified proxies

Grasshopper.GUI.GH_MultilineStringEditor.ListToBox
formats all items in the cache and builds the textbox content

Grasshopper.GUI.GH_MultilineStringEditor.BoxToList
Parses all items in the textbox and rebuilds the cache
Remarks: Does nothing if the Default value proxy is not parsable

Grasshopper.GUI.GH_MultilineStringEditor.tmlSelChecked_Tick(System.Object,System.EventArgs)
Checks for changes in the selection state on a 10ms interval
Remarks: This is really hacky, but I can't find another way to reliably handle selection change events

Grasshopper.GUI.GH_MultilineStringEditor
Utility class that adds certain multi-line features to standard windows Textboxes.