Grasshopper.GUI.Ribbon.GH_Ribbon.ActiveTab
Returns the first active tab or Null is no active tab is defined

Grasshopper.GUI.Ribbon.GH_Ribbon.FindProxy(System.Guid,System.Drawing.Rectangle@,System.Drawing.Rectangle@)
Iterates over all tabs and panels to try and find the icon with
the associated proxy id.
id: ID of proxy to search for.
Returns: Rectangle of proxy icon or Rectangle.Empty if the icon could not be found.
Rectangle is defined in screen coordinates, not control coordinates.