Grasshopper.Kernel.IGH_ActiveObject.RegisterRemoteIDs(Grasshopper.Kernel.GH_IdTable)
If this object depends on Rhino Objects, you must register the UUIDs of those objects.
Failure to do so will result in faulty event handling.
id_list: The object ID database Grasshopper is responsive to.