Grasshopper.Kernel.Special.GH_ClusterInputHookAttributes.ArrowOutline(System.Drawing.Point)
Creates a Cluster parameter arrow shape outline.
pivot: Tip of arrow.
Returns: Graphics path for the arrow outline.

Grasshopper.Kernel.Special.GH_ClusterInputHookAttributes.ArrowInline(System.Drawing.Point)
Creates a Cluster parameter arrow shape inline.
pivot: Tip of arrow.
Returns: Graphics path for the arrow inline.