Grasshopper.GUI.StringDisplay.IGH_StringListItem.ComputeSize(System.Int32)
Compute the size of this item as a function of layout dimensions.
Returns: The width and height as dictated by the item properties.

Grasshopper.GUI.StringDisplay.IGH_StringListItem.BoundingBox
Gets or sets the BoundingBox for this item.
BoundingBoxes are assigned and retrieved by the GH_StringList class only.
It's just convenient to store them on List Items directly.

Grasshopper.GUI.StringDisplay.IGH_StringListItem.RenderItem(System.Drawing.Graphics,System.Drawing.Rectangle)
Render this item into the specified destination rectangle.
G: Graphics objects to draw with.
destination: Layout rectangle for this item.

Grasshopper.GUI.StringDisplay.IGH_StringListItem
Represents a single entry in a StringList