Grasshopper.Kernel.GH_DocumentObject.OnSolutionExpired(System.Boolean)
Raises the SolutionExpired event on the toplevel object.
You probably want to call ExpireSolution() instead of this method directly.
bRecompute: If True, the solution will be immediately recalculated.

Grasshopper.Kernel.GH_DocumentObject.ExpireSolution(System.Boolean)
Call this function whenever you do something which expires the current solution.
This will make sure all caches are erased, all downstream objects are expired and that
the event is raised.
The default implementation merely places a call to OnSolutionExpired(), override this function
in derived classes to make sure you clear local data caches and expire downstream objects.
bRecompute: If True, the solution will be recomputed straight away.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendGenericMenuItem(System.Windows.Forms.ToolStrip,System.String,System.EventHandler,System.Drawing.Image,System.Object,System.Boolean,System.Boolean)
Utility function for appending generic menu items.
menu: Menu to append item to.
text: Item text.
on_click: Delegate that handles click events. If nothing, the click event will not be handled.
image: Item icon, or null for no icon.
tag: Object to assign as a Tag to the item.
enabled: If true, the item will be enabled.
checked: If true, the item will be checked.
Returns: The appended item

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendGenericTextItem(System.Windows.Forms.ToolStripDropDown,System.String,Grasshopper.GUI.GH_MenuTextBoxCollection.KeyDownEventHandler,Grasshopper.GUI.GH_MenuTextBoxCollection.TextChangedEventHandler,System.Boolean,System.Int32,System.Boolean)
Utility function for inserting text boxes into dropdown menus.
menu: Dropdown to add a textbox to.
text: Content of textbox.
on_keydown: Delegate for the KeyDown event.
on_textchanged: Delegate for the TextChanged event.
enabled: If true, the textbox will be enabled.
width: If larger than zero, we'll do our very best to grow the menu to the given width. No guarantees.
lock_focus: If true, then a GotFocus event will lock the other menu items.
Returns: The appended text box item.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendGenericCustomItem(System.Windows.Forms.ToolStripDropDown,System.Windows.Forms.Control,Grasshopper.GUI.GH_MenuCustomControlCollection.KeyDownEventHandler,System.Boolean,System.Int32,System.Boolean)
Utility function for inserting exotic controls into dropdown menus.
menu: Dropdown to add a control to.
item: Control to insert.
on_keydown: Delegate for key-presses.
enabled: If true, the control will be enabled.
width: Width hint for the control.
lock_focus: If true and the control gets focus, the rest of the menu will be locked.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendGenericCustomItem(System.Windows.Forms.ToolStripDropDown,System.Windows.Forms.Control,System.Boolean,System.Int32,System.Boolean)
Utility function for inserting exotic controls into dropdown menus.
menu: Dropdown to add a control to.
item: Control to insert.
enabled: If true, the control will be enabled.
width: Width hint for the control.
lock_focus: If true and the control gets focus, the rest of the menu will be locked.

Grasshopper.Kernel.GH_DocumentObject.Menu_AppendGenericColourPicker(System.Windows.Forms.ToolStripDropDown,System.String,System.Drawing.Color,System.Boolean,Grasshopper.Kernel.GH_DocumentObject.ColourEventHandler)
Add a colour picker to a menu.
menu: Menu to add to.
text: Name of colour picker item.
colour: Default colour.
layer: If true, the colour picker will be added one level deep.
event_handler: Handler for Colour picker changed events.
Returns: Menu item representing the colour picker.