Grasshopper.Kernel.Attributes.GH_ComponentAttributes.m_capsuleOuter
Represents the capsule of the component including the parameters.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.m_capsuleInner
Represents the capsule of the component box only.

Grasshopper.Kernel.Attributes.GH_ComponentAttributes.m_zuiAnimator
Maintains the time-based fading animation data.