Grasshopper.Kernel.GH_PersistentParam`1.m_data_persistent
Local persistent data.

Grasshopper.Kernel.GH_PersistentParam`1.AddPersistentData(System.Object)
Attempts to add a new persistent data item.
data: Data to add.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_PersistentParam`1.AddPersistentData(`0)
Attempts to add a new persistent data item.
data: Data to add.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_PersistentParam`1.PersistentData
Gets the list of persistent data stored in this parameter.

Grasshopper.Kernel.GH_PersistentParam`1.ClearPersistentData
Destroy all persistent Data.