Grasshopper.Kernel.GH_DocumentIO.Copy(Grasshopper.Kernel.GH_ClipboardType)
Copy the internal document into the Windows clipboard.
clipboard: Specifies the clipboard type to use.

Grasshopper.Kernel.GH_DocumentIO.Copy(Grasshopper.Kernel.GH_ClipboardType,System.Boolean)
Copy the internal document into the clipboard.
clipboard: Specifies the clipboard type to use.
limit_to_selection: If true, only the selected objects will be copied.
Returns: True on success, false on failure.

Grasshopper.Kernel.GH_DocumentIO.Copy(Grasshopper.Kernel.GH_ClipboardType,System.Collections.Generic.IEnumerable{System.Guid})
Copy the specified objects in the internal document into the clipboard.
clipboard: Specifies the clipboard type to use.
objects: List of object ids to copy.
Returns: True on success, false on failure.