Grasshopper.Kernel.GH_ClipboardType.System
Identifies the Operating System clipboard shared among all applications.

Grasshopper.Kernel.GH_ClipboardType.Global
Identifies the DocumentIO clipboard which is accessible from all instances of GH_DocumentIO.