Grasshopper.Kernel.GH_RCP_Group.Name
Gets or sets the name of the group.

Grasshopper.Kernel.GH_RCP_Group.Colour
Gets or sets the colour of the group.

Grasshopper.Kernel.GH_RCP_Group.Collapsed
Gets or sets the collapsed state of the group.

Grasshopper.Kernel.GH_RCP_Group.Bounds
Gets or sets the bounds of the group.

Grasshopper.Kernel.GH_RCP_Group.ItemCount
Gets the number of items contained in this group.

Grasshopper.Kernel.GH_RCP_Group.Items
Gets the list of items contained in this group.

Grasshopper.Kernel.GH_RCP_Group
Represents a single panel in the Remote Control Panel.