Grasshopper.Kernel.GH_CentralisedSettings.RibbonVisible
Gets or sets a value indicating whether components marked with DropDown exposure
are drawn on the main toolbar anyway.

Grasshopper.Kernel.GH_CentralisedSettings.RibbonShowObscure
Gets or sets a value indicating whether components marked with DropDown exposure
are drawn on the main toolbar anyway.

Grasshopper.Kernel.GH_CentralisedSettings.RibbonSeparators
Gets or sets whether there are separators between different exposures on the component Ribbon.

Grasshopper.Kernel.GH_CentralisedSettings.CanvasFancyWires
Gets or sets whether or not fancy wires will be drawn. This is a global setting.

Grasshopper.Kernel.GH_CentralisedSettings.CanvasObjectIcons
Gets or sets the global default for icon display.

Grasshopper.Kernel.GH_CentralisedSettings.CanvasRadialMenu
Gets or sets the global default for whether the canvas should use Radial or olds-kool menus.

Grasshopper.Kernel.GH_CentralisedSettings.CanvasFullNames
Gets or sets the global default for verbose UI. When CanvasFullNames=True,
parameter nicknames are set to their actual (long) names upon addition.

Grasshopper.Kernel.GH_CentralisedSettings.CanvasObsoleteTags
Gets or sets the global default for obsolete tags.

Grasshopper.Kernel.GH_CentralisedSettings.ViewportMeshEdges
Gets or sets the Mesh Wire display flag.

Grasshopper.Kernel.GH_CentralisedSettings.ViewportPlaneRadius
Gets or sets the global Plane radius.

Grasshopper.Kernel.GH_CentralisedSettings.CreateSolutionUndoRecord
Gets or sets whether Grasshopper document solutions are wrapped in undo records.

Grasshopper.Kernel.GH_CentralisedSettings.PruderyLevel
Gets or sets the Grasshopper UI prudery level.

Grasshopper.Kernel.GH_CentralisedSettings.RibbonVisibleChanged
Raised whenever the RibbonVisible setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.RibbonAllIconsChanged
Raised whenever the RibbonAllIcons setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.RibbonSeparatorsChanged
Raised whenever the RibbonSeparators setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.CanvasFancyWiresChanged
Raised whenever the CanvasFancyWires setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.CanvasObjectIconsChanged
Raised whenever the CanvasObjectIcons setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.CanvasRadialMenuChanged
Raised whenever the CanvasRadialMenu setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.CanvasFullNamesChanged
Raised whenever the CanvasFullNames setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.CanvasObsoleteTagsChanged
Raised whenever the CanvasObsoleteTags setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.ViewportMeshEdgesChanged
Raised whenever the AlwaysDrawMeshWires setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.ViewportPlaneRadiusChanged
Raised whenever the PlaneRadius setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.CreateSolutionUndoRecordChanged
Raised whenever the CreateSolutionUndoRecord setting changes.

Grasshopper.Kernel.GH_CentralisedSettings.PruderyLevelChanged
Raised whenever the PruderyLevel setting changes.

Grasshopper.Kernel.GH_CentralisedSettings
Represents a collection of program wide settings and events for when those settings change.
This should probably be the bottleneck for all program wide settings, but stuff is still littered about for now.