Grasshopper.Kernel.Types.GH_UserDataAccess.#ctor(Grasshopper.Kernel.Types.IGH_Goo)
Constructor for Grasshopper user data accessor object.
owner: Existing user data, may be null.

Grasshopper.Kernel.Types.GH_UserDataAccess.IsUserData
Gets a value indicating whether or not any user data has been assigned.

Grasshopper.Kernel.Types.GH_UserDataAccess.IsEntry(System.Guid)
Tests to see whether a User Data entry has been defined.
id: User Data Entry ID to search for.
Returns: True if the ID has been defined, false if not.

Grasshopper.Kernel.Types.GH_UserDataAccess.GetEntry(System.Guid)
Get the user data entry with the given ID.
id: User data entry ID to retrieve.
Returns: The user data Chunk with the given ID or null if no such entry exists.

Grasshopper.Kernel.Types.GH_UserDataAccess.CreateEntry(System.Guid)
Create a new User Data entry. If an entry with the same ID already exists it will be overwritten.
id: ID of user data entry to create.
Returns: The newly created user data entry.

Grasshopper.Kernel.Types.GH_UserDataAccess.GetOrCreateEntry(System.Guid)
Get the user data entry with the given ID. If the entry doesn't exist yet it will be created.
id: User data entry ID to retrieve.
Returns: The user data Chunk with the given ID.

Grasshopper.Kernel.Types.GH_UserDataAccess.DeleteEntry(System.Guid)
Deletes the entry with the specified ID. If this entry was the last remaining entry
the entire UserData will be destroyed.
id: ID of entry to delete.
Returns: True on success, false on failure.

Grasshopper.Kernel.Types.GH_UserDataAccess
Accessor type for IGH_Goo user data.
This object does not actually store the user data,
it merely provides access to user data dictionaries on the original IGH_Goo instance.
Every time you call IGH_Goo.UserData you will get a new instance of GH_UserDataAccess.