Grasshopper.Kernel.Data.GH_Structure`1.Graft(System.Boolean)
Grafts all paths by reallocating all data into child paths.
clear_single_nulls: If True, nulls will not be grafted.

Grasshopper.Kernel.Data.GH_Structure`1.Graft(Grasshopper.Kernel.Data.GH_Path,System.Boolean)
Grafts a specific path by reallocating all data into child paths.
If a grafted path coincides with an existing path,
the data item in question will be appended to the existing path.
path: Path of data to graft.
clear_single_nulls: If true, nulls will not be grafted.