Grasshopper.Kernel.GH_FileWatcher.#ctor(System.String,System.Boolean,Grasshopper.Kernel.GH_FileWatcher.FileChanged)
Create a new file watcher.
path: File path to watch.
activate: If true, the watcher will be active right away.
changeDelegate: Reference to a method that adheres to FileChanged delegate.
This method will be invoked when the file changes.

Grasshopper.Kernel.GH_FileWatcher.Path
Gets the file path currently being watched.