Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.#ctor
Create a new blank String List Item.

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.#ctor(System.String,System.Drawing.Font)
Create a new String List Item.
text: Text of item.
font: Font of item (fonts are assumed to be shared and will not be disposed automatically)

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.#ctor(System.String,System.Drawing.Font,System.Drawing.Color)
Create a new String List Item.
text: Text of item.
font: Font of item (fonts are assumed to be shared and will not be disposed automatically)

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.#ctor(System.String,System.Drawing.Font,System.Drawing.StringAlignment)
Create a new String List Item.
text: Text of item.
font: Font of item (fonts are assumed to be shared and will not be disposed automatically)
alignment: Alignment of text.

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.#ctor(System.String,System.Drawing.Font,System.Drawing.Color,System.Drawing.StringAlignment)
Create a new String List Item.
text: Text of item.
font: Font of item (fonts are assumed to be shared and will not be disposed automatically)
alignment: Alignment of text.

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.BoundingBox
Gets or sets the BoundingBox for this item.

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.Text
Gets or sets the text of this item.

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.Font
Gets or sets the Font to use while drawing this item.
It is the responsibility of the owner to dispose Fonts.

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.Type
Gets or sets the generic type code for the item.
This code is not used by the String List classes but
it allows implementers to easily keep track of different
items in case special drawing actions are required.

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.Colour
Gets or sets the colour to use while drawing this item.

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem.Alignment
Gets or sets the horizontal alignment to use when drawing this item.

Grasshopper.GUI.StringDisplay.GH_SimpleStringListItem
Base implementation of IGH_StringListItem