Grasshopper.Kernel.GH_ComponentParamServer.CreateDuplicate(Grasshopper.Kernel.IGH_Param)
Attempt to duplicate a parameter. Attributes will be ignored.
Warning! The duplicate will have the same ID as the original!
original: Parameter to duplicate.
Returns: A dupicate of the original or null on failure.