Grasshopper.GUI.GH_GooProxyList.SetProxies(Grasshopper.Kernel.Types.IGH_Goo,System.Collections.Generic.IEnumerable{Grasshopper.Kernel.Types.IGH_GooProxy})
Set the content for this control.
defaultType: Type instance to use when creating new items.
proxies: Existing proxies (can be null)

Grasshopper.GUI.GH_GooProxyList.DefaultProxy
Gets the default to use when creating new items.

Grasshopper.GUI.GH_GooProxyList.DefaultType
Gets the default type for this list.

Grasshopper.GUI.GH_GooProxyList.Proxies
Gets the proxies displayed in this control.

Grasshopper.GUI.GH_GooProxyList.ProxyCount
Gets the number of proxies contained in this control.

Grasshopper.GUI.GH_GooProxyList.SelectedProxies
Gets a list of all the selected proxies

Grasshopper.GUI.GH_GooProxyList.ProxyStackedRegions
Gets the rectangles for all proxy objects as a straight stacked layout, starting at the upper left corner of the ListViewRegion.

Grasshopper.GUI.GH_GooProxyList.ProxyScrolledRegions
Gets the rectangles for all proxy objects in control coordinates.

Grasshopper.GUI.GH_GooProxyList.ProxyIndexAt(System.Int32)
Find the index of the most relevant proxy at the given vertical pixel coordinate.
y: Vertical component of pixel.
Returns: The index for the most relevant proxy.

Grasshopper.GUI.GH_GooProxyList.m_mode
Represents the current mouse interaction modus.

Grasshopper.GUI.GH_GooProxyList.m_proxyIndex
Index of proxy currently under the mouse