Grasshopper.GUI.GH_ComponentGuidConflictDialog.SetupDialog(Grasshopper.Kernel.GH_ObjectProxy,Grasshopper.Kernel.GH_ObjectProxy)
Call this method prior to displaying the form
cLoaded:
cConflicted:
Remarks:

Grasshopper.GUI.GH_ComponentGuidConflictDialog.LoadedProxy
Returns an instance to the cached Loaded proxy
Returns:
Remarks:

Grasshopper.GUI.GH_ComponentGuidConflictDialog.ConflictingProxy
Returns an instance to the cached Conflicting proxy
Returns:
Remarks: